fe40/tutorials/rheoEFoam/channelEDF/PTT/DebyeHuckel/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             PTT;

                rho              rho [1 -3 0 0 0 0 0] 1000.;
                etaS             etaS [1 -1 -1 0 0 0 0] 0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.001;             
                lambda           lambda [0 0 1 0 0 0 0] 0.2256;
                epsilon          epsilon [0 0 0 0 0 0 0] .25;
                zeta             zeta [0 0 0 0 0 0 0] 0;
                
                destructionFunctionType  linear;
               
                stabilization    BSD;             
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
