fe40/tutorials/rheoEFoam/channelEDF/PTT/DebyeHuckel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       11770;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          30;
        startFace       11970;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       12000;
    }
    walls
    {
        type            wall;
        nFaces          30;
        startFace       12200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12230;
    }
)

// ************************************************************************* //
